###################################################################

# Created by write_sdc on Wed Aug 9 17:39:04 2017

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Xinport[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Yinport[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Uinport[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {Aport[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {DXport[0]}]
set_driving_cell -lib_cell INVX1 [get_ports clk]
set_driving_cell -lib_cell INVX1 [get_ports reset]
set_load -pin_load 0.004 [get_ports {Xoutport[31]}]
set_load -pin_load 0.004 [get_ports {Xoutport[30]}]
set_load -pin_load 0.004 [get_ports {Xoutport[29]}]
set_load -pin_load 0.004 [get_ports {Xoutport[28]}]
set_load -pin_load 0.004 [get_ports {Xoutport[27]}]
set_load -pin_load 0.004 [get_ports {Xoutport[26]}]
set_load -pin_load 0.004 [get_ports {Xoutport[25]}]
set_load -pin_load 0.004 [get_ports {Xoutport[24]}]
set_load -pin_load 0.004 [get_ports {Xoutport[23]}]
set_load -pin_load 0.004 [get_ports {Xoutport[22]}]
set_load -pin_load 0.004 [get_ports {Xoutport[21]}]
set_load -pin_load 0.004 [get_ports {Xoutport[20]}]
set_load -pin_load 0.004 [get_ports {Xoutport[19]}]
set_load -pin_load 0.004 [get_ports {Xoutport[18]}]
set_load -pin_load 0.004 [get_ports {Xoutport[17]}]
set_load -pin_load 0.004 [get_ports {Xoutport[16]}]
set_load -pin_load 0.004 [get_ports {Xoutport[15]}]
set_load -pin_load 0.004 [get_ports {Xoutport[14]}]
set_load -pin_load 0.004 [get_ports {Xoutport[13]}]
set_load -pin_load 0.004 [get_ports {Xoutport[12]}]
set_load -pin_load 0.004 [get_ports {Xoutport[11]}]
set_load -pin_load 0.004 [get_ports {Xoutport[10]}]
set_load -pin_load 0.004 [get_ports {Xoutport[9]}]
set_load -pin_load 0.004 [get_ports {Xoutport[8]}]
set_load -pin_load 0.004 [get_ports {Xoutport[7]}]
set_load -pin_load 0.004 [get_ports {Xoutport[6]}]
set_load -pin_load 0.004 [get_ports {Xoutport[5]}]
set_load -pin_load 0.004 [get_ports {Xoutport[4]}]
set_load -pin_load 0.004 [get_ports {Xoutport[3]}]
set_load -pin_load 0.004 [get_ports {Xoutport[2]}]
set_load -pin_load 0.004 [get_ports {Xoutport[1]}]
set_load -pin_load 0.004 [get_ports {Xoutport[0]}]
set_load -pin_load 0.004 [get_ports {Youtport[31]}]
set_load -pin_load 0.004 [get_ports {Youtport[30]}]
set_load -pin_load 0.004 [get_ports {Youtport[29]}]
set_load -pin_load 0.004 [get_ports {Youtport[28]}]
set_load -pin_load 0.004 [get_ports {Youtport[27]}]
set_load -pin_load 0.004 [get_ports {Youtport[26]}]
set_load -pin_load 0.004 [get_ports {Youtport[25]}]
set_load -pin_load 0.004 [get_ports {Youtport[24]}]
set_load -pin_load 0.004 [get_ports {Youtport[23]}]
set_load -pin_load 0.004 [get_ports {Youtport[22]}]
set_load -pin_load 0.004 [get_ports {Youtport[21]}]
set_load -pin_load 0.004 [get_ports {Youtport[20]}]
set_load -pin_load 0.004 [get_ports {Youtport[19]}]
set_load -pin_load 0.004 [get_ports {Youtport[18]}]
set_load -pin_load 0.004 [get_ports {Youtport[17]}]
set_load -pin_load 0.004 [get_ports {Youtport[16]}]
set_load -pin_load 0.004 [get_ports {Youtport[15]}]
set_load -pin_load 0.004 [get_ports {Youtport[14]}]
set_load -pin_load 0.004 [get_ports {Youtport[13]}]
set_load -pin_load 0.004 [get_ports {Youtport[12]}]
set_load -pin_load 0.004 [get_ports {Youtport[11]}]
set_load -pin_load 0.004 [get_ports {Youtport[10]}]
set_load -pin_load 0.004 [get_ports {Youtport[9]}]
set_load -pin_load 0.004 [get_ports {Youtport[8]}]
set_load -pin_load 0.004 [get_ports {Youtport[7]}]
set_load -pin_load 0.004 [get_ports {Youtport[6]}]
set_load -pin_load 0.004 [get_ports {Youtport[5]}]
set_load -pin_load 0.004 [get_ports {Youtport[4]}]
set_load -pin_load 0.004 [get_ports {Youtport[3]}]
set_load -pin_load 0.004 [get_ports {Youtport[2]}]
set_load -pin_load 0.004 [get_ports {Youtport[1]}]
set_load -pin_load 0.004 [get_ports {Youtport[0]}]
set_load -pin_load 0.004 [get_ports {Uoutport[31]}]
set_load -pin_load 0.004 [get_ports {Uoutport[30]}]
set_load -pin_load 0.004 [get_ports {Uoutport[29]}]
set_load -pin_load 0.004 [get_ports {Uoutport[28]}]
set_load -pin_load 0.004 [get_ports {Uoutport[27]}]
set_load -pin_load 0.004 [get_ports {Uoutport[26]}]
set_load -pin_load 0.004 [get_ports {Uoutport[25]}]
set_load -pin_load 0.004 [get_ports {Uoutport[24]}]
set_load -pin_load 0.004 [get_ports {Uoutport[23]}]
set_load -pin_load 0.004 [get_ports {Uoutport[22]}]
set_load -pin_load 0.004 [get_ports {Uoutport[21]}]
set_load -pin_load 0.004 [get_ports {Uoutport[20]}]
set_load -pin_load 0.004 [get_ports {Uoutport[19]}]
set_load -pin_load 0.004 [get_ports {Uoutport[18]}]
set_load -pin_load 0.004 [get_ports {Uoutport[17]}]
set_load -pin_load 0.004 [get_ports {Uoutport[16]}]
set_load -pin_load 0.004 [get_ports {Uoutport[15]}]
set_load -pin_load 0.004 [get_ports {Uoutport[14]}]
set_load -pin_load 0.004 [get_ports {Uoutport[13]}]
set_load -pin_load 0.004 [get_ports {Uoutport[12]}]
set_load -pin_load 0.004 [get_ports {Uoutport[11]}]
set_load -pin_load 0.004 [get_ports {Uoutport[10]}]
set_load -pin_load 0.004 [get_ports {Uoutport[9]}]
set_load -pin_load 0.004 [get_ports {Uoutport[8]}]
set_load -pin_load 0.004 [get_ports {Uoutport[7]}]
set_load -pin_load 0.004 [get_ports {Uoutport[6]}]
set_load -pin_load 0.004 [get_ports {Uoutport[5]}]
set_load -pin_load 0.004 [get_ports {Uoutport[4]}]
set_load -pin_load 0.004 [get_ports {Uoutport[3]}]
set_load -pin_load 0.004 [get_ports {Uoutport[2]}]
set_load -pin_load 0.004 [get_ports {Uoutport[1]}]
set_load -pin_load 0.004 [get_ports {Uoutport[0]}]
create_clock [get_ports clk]  -name ideal_clock1  -period 1  -waveform {0 0.5}
group_path -name FEEDTHROUGH  -from [list [get_ports {Xinport[31]}] [get_ports {Xinport[30]}] [get_ports {Xinport[29]}] [get_ports {Xinport[28]}] [get_ports {Xinport[27]}] [get_ports {Xinport[26]}] [get_ports {Xinport[25]}] [get_ports {Xinport[24]}] [get_ports {Xinport[23]}] [get_ports {Xinport[22]}] [get_ports {Xinport[21]}] [get_ports {Xinport[20]}] [get_ports {Xinport[19]}] [get_ports {Xinport[18]}] [get_ports {Xinport[17]}] [get_ports {Xinport[16]}] [get_ports {Xinport[15]}] [get_ports {Xinport[14]}] [get_ports {Xinport[13]}] [get_ports {Xinport[12]}] [get_ports {Xinport[11]}] [get_ports {Xinport[10]}] [get_ports {Xinport[9]}] [get_ports {Xinport[8]}] [get_ports {Xinport[7]}] [get_ports {Xinport[6]}] [get_ports {Xinport[5]}] [get_ports {Xinport[4]}] [get_ports {Xinport[3]}] [get_ports {Xinport[2]}] [get_ports {Xinport[1]}] [get_ports {Xinport[0]}] [get_ports {Yinport[31]}] [get_ports {Yinport[30]}] [get_ports {Yinport[29]}] [get_ports {Yinport[28]}] [get_ports {Yinport[27]}] [get_ports {Yinport[26]}] [get_ports {Yinport[25]}] [get_ports {Yinport[24]}] [get_ports {Yinport[23]}] [get_ports {Yinport[22]}] [get_ports {Yinport[21]}] [get_ports {Yinport[20]}] [get_ports {Yinport[19]}] [get_ports {Yinport[18]}] [get_ports {Yinport[17]}] [get_ports {Yinport[16]}] [get_ports {Yinport[15]}] [get_ports {Yinport[14]}] [get_ports {Yinport[13]}] [get_ports {Yinport[12]}] [get_ports {Yinport[11]}] [get_ports {Yinport[10]}] [get_ports {Yinport[9]}] [get_ports {Yinport[8]}] [get_ports {Yinport[7]}] [get_ports {Yinport[6]}] [get_ports {Yinport[5]}] [get_ports {Yinport[4]}] [get_ports {Yinport[3]}] [get_ports {Yinport[2]}] [get_ports {Yinport[1]}] [get_ports {Yinport[0]}] [get_ports {Uinport[31]}] [get_ports {Uinport[30]}] [get_ports {Uinport[29]}] [get_ports {Uinport[28]}] [get_ports {Uinport[27]}] [get_ports {Uinport[26]}] [get_ports {Uinport[25]}] [get_ports {Uinport[24]}] [get_ports {Uinport[23]}] [get_ports {Uinport[22]}] [get_ports {Uinport[21]}] [get_ports {Uinport[20]}] [get_ports {Uinport[19]}] [get_ports {Uinport[18]}] [get_ports {Uinport[17]}] [get_ports {Uinport[16]}] [get_ports {Uinport[15]}] [get_ports {Uinport[14]}] [get_ports {Uinport[13]}] [get_ports {Uinport[12]}] [get_ports {Uinport[11]}] [get_ports {Uinport[10]}] [get_ports {Uinport[9]}] [get_ports {Uinport[8]}] [get_ports {Uinport[7]}] [get_ports {Uinport[6]}] [get_ports {Uinport[5]}] [get_ports {Uinport[4]}] [get_ports {Uinport[3]}] [get_ports {Uinport[2]}] [get_ports {Uinport[1]}] [get_ports {Uinport[0]}] [get_ports {Aport[31]}] [get_ports {Aport[30]}] [get_ports {Aport[29]}] [get_ports {Aport[28]}] [get_ports {Aport[27]}] [get_ports {Aport[26]}] [get_ports {Aport[25]}] [get_ports {Aport[24]}] [get_ports {Aport[23]}] [get_ports {Aport[22]}] [get_ports {Aport[21]}] [get_ports {Aport[20]}] [get_ports {Aport[19]}] [get_ports {Aport[18]}] [get_ports {Aport[17]}] [get_ports {Aport[16]}] [get_ports {Aport[15]}] [get_ports {Aport[14]}] [get_ports {Aport[13]}] [get_ports {Aport[12]}] [get_ports {Aport[11]}] [get_ports {Aport[10]}] [get_ports {Aport[9]}] [get_ports {Aport[8]}] [get_ports {Aport[7]}] [get_ports {Aport[6]}] [get_ports {Aport[5]}] [get_ports {Aport[4]}] [get_ports {Aport[3]}] [get_ports {Aport[2]}] [get_ports {Aport[1]}] [get_ports {Aport[0]}] [get_ports {DXport[31]}] [get_ports {DXport[30]}] [get_ports {DXport[29]}] [get_ports {DXport[28]}] [get_ports {DXport[27]}] [get_ports {DXport[26]}] [get_ports {DXport[25]}] [get_ports {DXport[24]}] [get_ports {DXport[23]}] [get_ports {DXport[22]}] [get_ports {DXport[21]}] [get_ports {DXport[20]}] [get_ports {DXport[19]}] [get_ports {DXport[18]}] [get_ports {DXport[17]}] [get_ports {DXport[16]}] [get_ports {DXport[15]}] [get_ports {DXport[14]}] [get_ports {DXport[13]}] [get_ports {DXport[12]}] [get_ports {DXport[11]}] [get_ports {DXport[10]}] [get_ports {DXport[9]}] [get_ports {DXport[8]}] [get_ports {DXport[7]}] [get_ports {DXport[6]}] [get_ports {DXport[5]}] [get_ports {DXport[4]}] [get_ports {DXport[3]}] [get_ports {DXport[2]}] [get_ports {DXport[1]}] [get_ports {DXport[0]}] [get_ports reset]]  -to [list [get_ports {Xoutport[31]}] [get_ports {Xoutport[30]}] [get_ports {Xoutport[29]}] [get_ports {Xoutport[28]}] [get_ports {Xoutport[27]}] [get_ports {Xoutport[26]}] [get_ports {Xoutport[25]}] [get_ports {Xoutport[24]}] [get_ports {Xoutport[23]}] [get_ports {Xoutport[22]}] [get_ports {Xoutport[21]}] [get_ports {Xoutport[20]}] [get_ports {Xoutport[19]}] [get_ports {Xoutport[18]}] [get_ports {Xoutport[17]}] [get_ports {Xoutport[16]}] [get_ports {Xoutport[15]}] [get_ports {Xoutport[14]}] [get_ports {Xoutport[13]}] [get_ports {Xoutport[12]}] [get_ports {Xoutport[11]}] [get_ports {Xoutport[10]}] [get_ports {Xoutport[9]}] [get_ports {Xoutport[8]}] [get_ports {Xoutport[7]}] [get_ports {Xoutport[6]}] [get_ports {Xoutport[5]}] [get_ports {Xoutport[4]}] [get_ports {Xoutport[3]}] [get_ports {Xoutport[2]}] [get_ports {Xoutport[1]}] [get_ports {Xoutport[0]}] [get_ports {Youtport[31]}] [get_ports {Youtport[30]}] [get_ports {Youtport[29]}] [get_ports {Youtport[28]}] [get_ports {Youtport[27]}] [get_ports {Youtport[26]}] [get_ports {Youtport[25]}] [get_ports {Youtport[24]}] [get_ports {Youtport[23]}] [get_ports {Youtport[22]}] [get_ports {Youtport[21]}] [get_ports {Youtport[20]}] [get_ports {Youtport[19]}] [get_ports {Youtport[18]}] [get_ports {Youtport[17]}] [get_ports {Youtport[16]}] [get_ports {Youtport[15]}] [get_ports {Youtport[14]}] [get_ports {Youtport[13]}] [get_ports {Youtport[12]}] [get_ports {Youtport[11]}] [get_ports {Youtport[10]}] [get_ports {Youtport[9]}] [get_ports {Youtport[8]}] [get_ports {Youtport[7]}] [get_ports {Youtport[6]}] [get_ports {Youtport[5]}] [get_ports {Youtport[4]}] [get_ports {Youtport[3]}] [get_ports {Youtport[2]}] [get_ports {Youtport[1]}] [get_ports {Youtport[0]}] [get_ports {Uoutport[31]}] [get_ports {Uoutport[30]}] [get_ports {Uoutport[29]}] [get_ports {Uoutport[28]}] [get_ports {Uoutport[27]}] [get_ports {Uoutport[26]}] [get_ports {Uoutport[25]}] [get_ports {Uoutport[24]}] [get_ports {Uoutport[23]}] [get_ports {Uoutport[22]}] [get_ports {Uoutport[21]}] [get_ports {Uoutport[20]}] [get_ports {Uoutport[19]}] [get_ports {Uoutport[18]}] [get_ports {Uoutport[17]}] [get_ports {Uoutport[16]}] [get_ports {Uoutport[15]}] [get_ports {Uoutport[14]}] [get_ports {Uoutport[13]}] [get_ports {Uoutport[12]}] [get_ports {Uoutport[11]}] [get_ports {Uoutport[10]}] [get_ports {Uoutport[9]}] [get_ports {Uoutport[8]}] [get_ports {Uoutport[7]}] [get_ports {Uoutport[6]}] [get_ports {Uoutport[5]}] [get_ports {Uoutport[4]}] [get_ports {Uoutport[3]}] [get_ports {Uoutport[2]}] [get_ports {Uoutport[1]}] [get_ports {Uoutport[0]}]]
group_path -name REGIN  -from [list [get_ports {Xinport[31]}] [get_ports {Xinport[30]}] [get_ports {Xinport[29]}] [get_ports {Xinport[28]}] [get_ports {Xinport[27]}] [get_ports {Xinport[26]}] [get_ports {Xinport[25]}] [get_ports {Xinport[24]}] [get_ports {Xinport[23]}] [get_ports {Xinport[22]}] [get_ports {Xinport[21]}] [get_ports {Xinport[20]}] [get_ports {Xinport[19]}] [get_ports {Xinport[18]}] [get_ports {Xinport[17]}] [get_ports {Xinport[16]}] [get_ports {Xinport[15]}] [get_ports {Xinport[14]}] [get_ports {Xinport[13]}] [get_ports {Xinport[12]}] [get_ports {Xinport[11]}] [get_ports {Xinport[10]}] [get_ports {Xinport[9]}] [get_ports {Xinport[8]}] [get_ports {Xinport[7]}] [get_ports {Xinport[6]}] [get_ports {Xinport[5]}] [get_ports {Xinport[4]}] [get_ports {Xinport[3]}] [get_ports {Xinport[2]}] [get_ports {Xinport[1]}] [get_ports {Xinport[0]}] [get_ports {Yinport[31]}] [get_ports {Yinport[30]}] [get_ports {Yinport[29]}] [get_ports {Yinport[28]}] [get_ports {Yinport[27]}] [get_ports {Yinport[26]}] [get_ports {Yinport[25]}] [get_ports {Yinport[24]}] [get_ports {Yinport[23]}] [get_ports {Yinport[22]}] [get_ports {Yinport[21]}] [get_ports {Yinport[20]}] [get_ports {Yinport[19]}] [get_ports {Yinport[18]}] [get_ports {Yinport[17]}] [get_ports {Yinport[16]}] [get_ports {Yinport[15]}] [get_ports {Yinport[14]}] [get_ports {Yinport[13]}] [get_ports {Yinport[12]}] [get_ports {Yinport[11]}] [get_ports {Yinport[10]}] [get_ports {Yinport[9]}] [get_ports {Yinport[8]}] [get_ports {Yinport[7]}] [get_ports {Yinport[6]}] [get_ports {Yinport[5]}] [get_ports {Yinport[4]}] [get_ports {Yinport[3]}] [get_ports {Yinport[2]}] [get_ports {Yinport[1]}] [get_ports {Yinport[0]}] [get_ports {Uinport[31]}] [get_ports {Uinport[30]}] [get_ports {Uinport[29]}] [get_ports {Uinport[28]}] [get_ports {Uinport[27]}] [get_ports {Uinport[26]}] [get_ports {Uinport[25]}] [get_ports {Uinport[24]}] [get_ports {Uinport[23]}] [get_ports {Uinport[22]}] [get_ports {Uinport[21]}] [get_ports {Uinport[20]}] [get_ports {Uinport[19]}] [get_ports {Uinport[18]}] [get_ports {Uinport[17]}] [get_ports {Uinport[16]}] [get_ports {Uinport[15]}] [get_ports {Uinport[14]}] [get_ports {Uinport[13]}] [get_ports {Uinport[12]}] [get_ports {Uinport[11]}] [get_ports {Uinport[10]}] [get_ports {Uinport[9]}] [get_ports {Uinport[8]}] [get_ports {Uinport[7]}] [get_ports {Uinport[6]}] [get_ports {Uinport[5]}] [get_ports {Uinport[4]}] [get_ports {Uinport[3]}] [get_ports {Uinport[2]}] [get_ports {Uinport[1]}] [get_ports {Uinport[0]}] [get_ports {Aport[31]}] [get_ports {Aport[30]}] [get_ports {Aport[29]}] [get_ports {Aport[28]}] [get_ports {Aport[27]}] [get_ports {Aport[26]}] [get_ports {Aport[25]}] [get_ports {Aport[24]}] [get_ports {Aport[23]}] [get_ports {Aport[22]}] [get_ports {Aport[21]}] [get_ports {Aport[20]}] [get_ports {Aport[19]}] [get_ports {Aport[18]}] [get_ports {Aport[17]}] [get_ports {Aport[16]}] [get_ports {Aport[15]}] [get_ports {Aport[14]}] [get_ports {Aport[13]}] [get_ports {Aport[12]}] [get_ports {Aport[11]}] [get_ports {Aport[10]}] [get_ports {Aport[9]}] [get_ports {Aport[8]}] [get_ports {Aport[7]}] [get_ports {Aport[6]}] [get_ports {Aport[5]}] [get_ports {Aport[4]}] [get_ports {Aport[3]}] [get_ports {Aport[2]}] [get_ports {Aport[1]}] [get_ports {Aport[0]}] [get_ports {DXport[31]}] [get_ports {DXport[30]}] [get_ports {DXport[29]}] [get_ports {DXport[28]}] [get_ports {DXport[27]}] [get_ports {DXport[26]}] [get_ports {DXport[25]}] [get_ports {DXport[24]}] [get_ports {DXport[23]}] [get_ports {DXport[22]}] [get_ports {DXport[21]}] [get_ports {DXport[20]}] [get_ports {DXport[19]}] [get_ports {DXport[18]}] [get_ports {DXport[17]}] [get_ports {DXport[16]}] [get_ports {DXport[15]}] [get_ports {DXport[14]}] [get_ports {DXport[13]}] [get_ports {DXport[12]}] [get_ports {DXport[11]}] [get_ports {DXport[10]}] [get_ports {DXport[9]}] [get_ports {DXport[8]}] [get_ports {DXport[7]}] [get_ports {DXport[6]}] [get_ports {DXport[5]}] [get_ports {DXport[4]}] [get_ports {DXport[3]}] [get_ports {DXport[2]}] [get_ports {DXport[1]}] [get_ports {DXport[0]}] [get_ports reset]]
group_path -name REGOUT  -to [list [get_ports {Xoutport[31]}] [get_ports {Xoutport[30]}] [get_ports {Xoutport[29]}] [get_ports {Xoutport[28]}] [get_ports {Xoutport[27]}] [get_ports {Xoutport[26]}] [get_ports {Xoutport[25]}] [get_ports {Xoutport[24]}] [get_ports {Xoutport[23]}] [get_ports {Xoutport[22]}] [get_ports {Xoutport[21]}] [get_ports {Xoutport[20]}] [get_ports {Xoutport[19]}] [get_ports {Xoutport[18]}] [get_ports {Xoutport[17]}] [get_ports {Xoutport[16]}] [get_ports {Xoutport[15]}] [get_ports {Xoutport[14]}] [get_ports {Xoutport[13]}] [get_ports {Xoutport[12]}] [get_ports {Xoutport[11]}] [get_ports {Xoutport[10]}] [get_ports {Xoutport[9]}] [get_ports {Xoutport[8]}] [get_ports {Xoutport[7]}] [get_ports {Xoutport[6]}] [get_ports {Xoutport[5]}] [get_ports {Xoutport[4]}] [get_ports {Xoutport[3]}] [get_ports {Xoutport[2]}] [get_ports {Xoutport[1]}] [get_ports {Xoutport[0]}] [get_ports {Youtport[31]}] [get_ports {Youtport[30]}] [get_ports {Youtport[29]}] [get_ports {Youtport[28]}] [get_ports {Youtport[27]}] [get_ports {Youtport[26]}] [get_ports {Youtport[25]}] [get_ports {Youtport[24]}] [get_ports {Youtport[23]}] [get_ports {Youtport[22]}] [get_ports {Youtport[21]}] [get_ports {Youtport[20]}] [get_ports {Youtport[19]}] [get_ports {Youtport[18]}] [get_ports {Youtport[17]}] [get_ports {Youtport[16]}] [get_ports {Youtport[15]}] [get_ports {Youtport[14]}] [get_ports {Youtport[13]}] [get_ports {Youtport[12]}] [get_ports {Youtport[11]}] [get_ports {Youtport[10]}] [get_ports {Youtport[9]}] [get_ports {Youtport[8]}] [get_ports {Youtport[7]}] [get_ports {Youtport[6]}] [get_ports {Youtport[5]}] [get_ports {Youtport[4]}] [get_ports {Youtport[3]}] [get_ports {Youtport[2]}] [get_ports {Youtport[1]}] [get_ports {Youtport[0]}] [get_ports {Uoutport[31]}] [get_ports {Uoutport[30]}] [get_ports {Uoutport[29]}] [get_ports {Uoutport[28]}] [get_ports {Uoutport[27]}] [get_ports {Uoutport[26]}] [get_ports {Uoutport[25]}] [get_ports {Uoutport[24]}] [get_ports {Uoutport[23]}] [get_ports {Uoutport[22]}] [get_ports {Uoutport[21]}] [get_ports {Uoutport[20]}] [get_ports {Uoutport[19]}] [get_ports {Uoutport[18]}] [get_ports {Uoutport[17]}] [get_ports {Uoutport[16]}] [get_ports {Uoutport[15]}] [get_ports {Uoutport[14]}] [get_ports {Uoutport[13]}] [get_ports {Uoutport[12]}] [get_ports {Uoutport[11]}] [get_ports {Uoutport[10]}] [get_ports {Uoutport[9]}] [get_ports {Uoutport[8]}] [get_ports {Uoutport[7]}] [get_ports {Uoutport[6]}] [get_ports {Uoutport[5]}] [get_ports {Uoutport[4]}] [get_ports {Uoutport[3]}] [get_ports {Uoutport[2]}] [get_ports {Uoutport[1]}] [get_ports {Uoutport[0]}]]
set_input_delay -clock ideal_clock1  0  [get_ports clk]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[31]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[30]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[29]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[28]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[27]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[26]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[25]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[24]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[23]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[22]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[21]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[20]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[19]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[18]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[17]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[16]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[15]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[14]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[13]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[12]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[11]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[10]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[9]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[8]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Xinport[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[31]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[30]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[29]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[28]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[27]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[26]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[25]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[24]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[23]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[22]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[21]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[20]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[19]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[18]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[17]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[16]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[15]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[14]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[13]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[12]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[11]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[10]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[9]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[8]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Yinport[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[31]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[30]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[29]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[28]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[27]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[26]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[25]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[24]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[23]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[22]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[21]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[20]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[19]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[18]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[17]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[16]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[15]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[14]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[13]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[12]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[11]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[10]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[9]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[8]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Uinport[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[31]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[30]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[29]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[28]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[27]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[26]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[25]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[24]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[23]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[22]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[21]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[20]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[19]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[18]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[17]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[16]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[15]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[14]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[13]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[12]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[11]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[10]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[9]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[8]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {Aport[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[31]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[30]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[29]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[28]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[27]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[26]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[25]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[24]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[23]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[22]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[21]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[20]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[19]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[18]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[17]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[16]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[15]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[14]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[13]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[12]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[11]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[10]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[9]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[8]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[7]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[6]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[5]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[4]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[3]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[2]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[1]}]
set_input_delay -clock ideal_clock1  0  [get_ports {DXport[0]}]
set_input_delay -clock ideal_clock1  0  [get_ports reset]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[31]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[30]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[29]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[28]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[27]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[26]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[25]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[24]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[23]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[22]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[21]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[20]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[19]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[18]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[17]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[16]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[15]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[14]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[13]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[12]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[11]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[10]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Xoutport[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[31]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[30]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[29]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[28]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[27]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[26]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[25]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[24]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[23]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[22]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[21]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[20]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[19]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[18]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[17]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[16]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[15]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[14]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[13]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[12]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[11]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[10]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Youtport[0]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[31]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[30]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[29]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[28]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[27]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[26]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[25]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[24]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[23]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[22]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[21]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[20]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[19]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[18]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[17]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[16]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[15]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[14]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[13]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[12]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[11]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[10]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[9]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[8]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[7]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[6]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[5]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[4]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[3]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[2]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[1]}]
set_output_delay -clock ideal_clock1  0  [get_ports {Uoutport[0]}]
